Sem3/diffur/Test_11_5.org
#+LATEX_CLASS: general
#+TITLE: For test
#+AUTHOR: Ilya Yaroshevskiy

1) задача
2) разделяющиеся переменные
3) линейное
4) Бернулли
5) УПД
6) понижение порядка
7) понижение порядка
8) метод последовательных приближений Пикара

* Задание 1
Фезека
* Задание 2
Уравнения приводящиеся в вид
\[ f(x)dx = g(y)dy \]
\[ \Downarrow \]
\[ \int f(x)dx = \int g(y)dy \]
\[ \Downarrow \]
\[ F(x) = G(y) \]
* Задание 3
Линейные уравнения первого порядка
\begin{gather*}
y' + a(x)y = f(x) \\
u(x) = \exp{\int{a(x)dx}} \\
y = \frac{\int{u(x)f(x)dx} + C}{u(x)}
\end{gather*}
* Задание 4
Уравнение вида $y' + a(x)y = b(x)y^m$ \\
При $m = 0$ - линейное уравнение \\
    $m = 1$ - уравнение с разделяющими переменными \\
Иначе сводится к линейному подстановкой $z = y^{1 - m}$ в уравнение 
$z' + (1 - m)a(x)z = (1 - m)b(x)$ 
* Задание 5
Уравнения вида
\[ P(x, y)dx + Q(x, y)dy = 0 \]
уравнение в полных диффернциалах если $\exists u(x, y): du(x, y) = P(x, y)dx + Q(x, y)dy$ \\
*И* $Q'_x = P'_y$ \\
Тогда решение $u(x, y) = C$

** Алгоритм
1. Запишем систему \\
   \begin{cases}
   \case u'_x = P(x, y) \\
   \case u'_y = Q(x, y) \\
   \end{cases}
2. Проинтегрируем первое уравнение по $x$, считая $y$ константой,
   так-же примем С за $\varphi(y)$ \\
   \[ u(x, y) = \int P(x, y)dx + \varphi(y) \]
3. Продифиренцируем полученное $u(x, y)$ по $y$ и подставим во второе уравнение \\
   \[ u'_y(x,y) = \left(\int P(x, y)dx \right)'_y + \varphi'_y(y) = Q(x, y)\]
4. Проинтегрируем полученное уранение и найдем $\varphi(y)$
   \[ \varphi(y) = \int\left[Q(x, y) - \left(\int P(x, y)dx \right)'_y\right]dy \]
5. Подставим $\varphi(y)$ в $u(x, y)$, получим итоговое решение \\
   \[ u(x, y) = C \]

** Нахождение интегрируещего множителя
Если $\frac{\partial Q}{\partial x} \not= \frac{\partial P}{\partial y}$ \\
Находим такое $\varphi(x, y)$, что:
\[ Q\varphi'_x - P\varphi'_y = \varphi(P'_y - Q'_x) \]

1. Если $\varphi(x, y) = \varphi(x)$, то найдем его из уравнения
   \[ \frac{1}{\varphi}\frac{d\varphi}{dx} = \frac{1}{Q}(P'_y - Q'_x) \]
2. Если $\varphi(x, y) = \varphi(y)$, то найдем его из уравнения
   \[ \frac{1}{\varphi}\frac{d\varphi}{dy} = -\frac{1}{P}(P'_y - Q'_x) \]
3. Если $\varphi$ зависит от обоих переменных, 
   тогда если $\exists z: \varphi(z) = \varphi(x, y)$, то найдем $\varphi$ из уравнения
   \[ \frac{1}{\varphi}\frac{d\varphi}{dz} = \frac{P'_y - Q'_x}{Qz'_x - Pz'_y} \]
   
* Задание 6
Уравнение вида
\[ F(x, y, y', y'') = 0 \]

1. $y'' = f(x)$ \\
   Возьмем новую функцию $p(x): y' = p(x)$ \\
   Тогда решим $p' = f(x)$, затем решим $y' = p(x)$
2. $y'' = f(y)$ \\
   Возьмем новую функцию $p(y): y' = p(y)$ \\
   Тогда решим $\frac{dp}{dy}p = f(y)$, затем решим $y' = p(y)$
3. $y'' = f(y')$ \\
   Возьмем новую функцию $p(x): y' = p(x)$ \\
   Тогда решим $p' = f(p)$, затем решим $y' = p(x)$
4. $y'' = f(x, y')$ \\
   Возьмем новую функцию $p(x): y' = p(x)$ \\
   Тогда решим $p' = f(x, p)$, затем решим $y' = p(x)$
5. $y'' = f(y, y')$ \\
   Возьмем новую функцию $p(y): y' = p(y)$ \\
   Тогда решим $\frac{dp}{dy}p = f(y, p)$, затем решим $y' = p(y)$
6. $F(x, y, y', y'')$ - одннородная функция аргументов $y, y', y''$ \\
   $F(x, ky, ky', ky'') = k^mF(x, y, y', y'') \Rightarrow$ однородная \\
   Используем подстановку $y = e^{\int z dx}$ \\
   Находим $z$, затем находим $y(x) = C_2e^{\int z dx}$
7. $F(x, y, y', y'')$ - точная производная \\
   Если найдем $\Phi(x, y, y'): F(x, y, y', y'') = \Phi'_x(x, y, y')$,
   то решение: $\Phi(x, y, y') = C$
   
* Задание 8
Метод Пикара \\
Дано $x_0$, $y' = f(x, y)$, $y_0 = y(x_0)$ \\
\[ y_n(x) = y_0 + \int_{x_0}^xf(\xi, y_{k-1}(\xi))d\xi \]

- *Пример* \\
 
  $t_0 = 0$
  \begin{cases}
  \case \dot{x} = x - y \\
  \case \dot{y} = tx
  \end{cases}

  /Прим./ $\dot{u}$ = $u'_t$
  
  \begin{gather*}
  x(0)=0, y(0)=0 \\
  x_n = x_0 + \int_0^t(x_{n-1}(\xi) - y_{n-1}(\xi))d\xi \\
  y_n = y_0 + \int_0^t(\xi x_{n - 1}(\xi))d\xi \\
  \\
  x_1 = 1 + t \\
  y_1 = \frac{t^2}{2} \\
  x_2 = 1 + t + \frac{t^2}{2} - \frac{t^3}{6} \\
  y_2 = \frac{t^2}{2} + \frac{t^3}{6}
  \end{gather*}
  
- *Пример*
  \[ y'' - y'\sin{x} - x^2 = 0 \]
  \[ y(0) = 1, y'(0) = 0 \]

  \begin{cases}
  \case y' = z \\
  \case z' = z\sin{x} + x^2
  \end{cases}
  
  \begin{gather*}
  y_0 = 1, z_0 = 0 \\
  y_n = y_0 + \int_0^xz_{n - 1}(\xi)d\xi \\
  z_n = z_0 + \int_0^x(z_{n-1}(\xi)\sin{\xi} + \xi^2)d\xi
  \\
  z_1 = \frac{x^3}{3} \\
  y_2 = 1 + \frac{x^4}{12}
  \end{gather*}
   
* Полезные техники
** Линейное однородное уравнение n-го порядка
Имеем уравнение: $y^{(n)}(x) + a_1y^{(n - 1)}(x) + \dots + a_ny(x) = 0$ \\
Решим такое уравнение: $\lambda^n + a_1\lambda^{n - 1} + \dots + a_{n-1}\lambda + a_n = 0$ \\
1. Все корни различные \\
   Тогда решение: $y(x) = C_1e^{\lambda_1x} + \dots + C_ne^{\lambda_nx}$
2. Есть кратные корни \\
   Есть n корней \\
   Различные корни: $\lambda_1, \dots, \lambda_m$ \\
   Степени корней: $k_1, \dots, k_m$ \\
   Тогда решение: 
   \[ y(x) = C_1e^{\lambda_1x} + C_2xe^{\lambda_1x} + \dots + C_{k_1}x^{k_1 - 1}e^{\lambda_1x} + \dots + C_{n - k_m + 1}e^{\lambda_mx} + C_{n - k_m + 2}xe^{\lambda_mx} + \dots + C_{n}x^{k_m - 1}e^{\lambda_mx}\]
   
